# Pandas
It provides many functions and methods to speed up the data analysis process.
The two primary data structures are Series which is 1 dimensional and DataFrame which is 2 dimensional.

# Reading of Data

In [23]:
import pandas as pd
df=pd.read_csv("data.csv")
df

         Name Gender  Age  Grade
0      Vishnu      M   21   8.71
1        Vedu      F   22   8.41
2      Pandey      M   21   8.40
3       Raval      F   22   8.20
4         Gtu      M   24   4.50
5       Vidhi      F   21   9.00
6       Surat      M   75  10.00
7  BhavnagarM    NaN  100  10.00

# Head()
Display the top 5 rows from our data set.We can provide the no. of rows that we want to display by providing the count as a parameter to the “head()” function

In [24]:
df.head()

     Name Gender  Age  Grade
0  Vishnu      M   21   8.71
1    Vedu      F   22   8.41
2  Pandey      M   21   8.40
3   Raval      F   22   8.20
4     Gtu      M   24   4.50

In [25]:
df.head(3)

     Name Gender  Age  Grade
0  Vishnu      M   21   8.71
1    Vedu      F   22   8.41
2  Pandey      M   21   8.40

# Tail()
Display the Last 5 rows from our data set.We can provide the no. of rows that we want to display by providing the count as a parameter to the “tail()” function

In [26]:
df.tail()

         Name Gender  Age  Grade
3       Raval      F   22    8.2
4         Gtu      M   24    4.5
5       Vidhi      F   21    9.0
6       Surat      M   75   10.0
7  BhavnagarM    NaN  100   10.0

In [27]:
df.tail(3)

         Name Gender  Age  Grade
5       Vidhi      F   21    9.0
6       Surat      M   75   10.0
7  BhavnagarM    NaN  100   10.0

# shape
Which will show the dimensions in (No. of rows, No. of columns) format.

In [28]:
df.shape

(8, 4)

# info()
It displays various information about our data such as the column names, no. of non-null values in each column(feature), type of each column, memory usage, etc.

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Gender  7 non-null      object
 2   Age     8 non-null      int64
 3   Grade   8 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 384.0+ bytes

# isnull()
we can find that the no. of null values in a DataFrame for every feature

In [30]:
df.isnull()

    Name  Gender    Age  Grade
0  False   False  False  False
1  False   False  False  False
2  False   False  False  False
3  False   False  False  False
4  False   False  False  False
5  False   False  False  False
6  False   False  False  False
7  False    True  False  False

In [31]:
df.isnull().sum()

Name      0
Gender    1
Age       0
Grade     0
dtype: int64

# drop()
we will drop that particular column

In [32]:
df1=pd.read_csv("data.csv")
df1

         Name Gender  Age  Grade
0      Vishnu      M   21   8.71
1        Vedu      F   22   8.41
2      Pandey      M   21   8.40
3       Raval      F   22   8.20
4         Gtu      M   24   4.50
5       Vidhi      F   21   9.00
6       Surat      M   75  10.00
7  BhavnagarM    NaN  100  10.00

In [33]:
df1.drop(["Age"],axis=1,inplace=True)

In [34]:
df1

         Name Gender  Grade
0      Vishnu      M   8.71
1        Vedu      F   8.41
2      Pandey      M   8.40
3       Raval      F   8.20
4         Gtu      M   4.50
5       Vidhi      F   9.00
6       Surat      M  10.00
7  BhavnagarM    NaN  10.00

In [35]:
df1.drop([df1.columns[1]],axis=1,inplace=True)
df1

         Name  Grade
0      Vishnu   8.71
1        Vedu   8.41
2      Pandey   8.40
3       Raval   8.20
4         Gtu   4.50
5       Vidhi   9.00
6       Surat  10.00
7  BhavnagarM  10.00

# fillna()
fill up the missing values

In [36]:
df['Gender'].fillna(0,inplace=True)
df

         Name Gender  Age  Grade
0      Vishnu      M   21   8.71
1        Vedu      F   22   8.41
2      Pandey      M   21   8.40
3       Raval      F   22   8.20
4         Gtu      M   24   4.50
5       Vidhi      F   21   9.00
6       Surat      M   75  10.00
7  BhavnagarM      0  100  10.00

# sample()
Allows us to choose random values from our data frame

In [37]:
df.sample(2)

         Name Gender  Age  Grade
7  BhavnagarM      0  100   10.0
2      Pandey      M   21    8.4

# loc() and iloc()
loc – select by labels

iloc – select by positions

In [38]:
df.loc[:5,['Name']]

     Name
0  Vishnu
1    Vedu
2  Pandey
3   Raval
4     Gtu
5   Vidhi

In [39]:
df.iloc[:3,:3]

     Name Gender  Age
0  Vishnu      M   21
1    Vedu      F   22
2  Pandey      M   21

# sort_values()

In [40]:
df.sort_values(by='Name')

         Name Gender  Age  Grade
7  BhavnagarM      0  100  10.00
4         Gtu      M   24   4.50
2      Pandey      M   21   8.40
3       Raval      F   22   8.20
6       Surat      M   75  10.00
1        Vedu      F   22   8.41
5       Vidhi      F   21   9.00
0      Vishnu      M   21   8.71

# query()
Function to filter our data frame as per our conditions or requirements

In [41]:
df.query('Gender=="M"')

     Name Gender  Age  Grade
0  Vishnu      M   21   8.71
2  Pandey      M   21   8.40
4     Gtu      M   24   4.50
6   Surat      M   75  10.00

# rename()
Reanme the Column Name

In [20]:
df.rename(columns={"Gender":"Sex"})

         Name Sex  Age  Grade
0      Vishnu   M   21   8.71
1        Vedu   F   22   8.41
2      Pandey   M   21   8.40
3       Raval   F   22   8.20
4         Gtu   M   24   4.50
5       Vidhi   F   21   9.00
6       Surat   M   75  10.00
7  BhavnagarM   0  100  10.00